# Use `brew bundle` to install the packages listed below

# Casks
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Fonts
cask 'font-anonymous-pro'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-droid-sans'
cask 'font-droid-sans-mono'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-input'
cask 'font-inconsolata'
cask 'font-inconsolata-for-powerline'
cask 'font-liberation-sans'
cask 'font-liberation-mono-for-powerline'
cask 'font-meslo-lg'
cask 'font-nixie-one'
cask 'font-office-code-pro'
cask 'font-pt-mono'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-ubuntu'

# Quick Look plugins
cask 'epubquicklook'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# Tools
brew 'brew-gem'
brew 'mas'
brew 'aria2'
cask 'the-unarchiver'
brew 'unrar'
brew 'wget'
brew 'tree'
brew 'youtube-dl'
brew 'ffmpeg'
brew 'gettext'
brew 'htop-osx'
brew 'readline'
brew 'openssl'
cask 'iterm2'
cask 'sublime-text'

# App Store
mas 'Tomato One', id: 907364780
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Microsoft OneNote', id: 784801555
mas 'Xcode', id: 497799835

# Apps
cask 'aerial'
cask 'cyberduck'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox'
cask 'skype'
cask 'sketch'
cask 'spotify'
cask 'vlc'

# Dev Tools
brew 'awscli'
cask 'chrome-devtools'
brew 'git'
brew 'heroku'
cask 'insomnia'
cask 'macdown'
cask 'postman'
cask 'slack'
cask 'visual-studio-code'

# Ruby
brew 'ruby'
brew 'rbenv'
brew 'ruby-build'

# Python
brew 'python'
brew 'python3'
brew 'pypy'
brew 'cookiecutter'

# Node
brew 'node@6'
brew 'npm'
brew 'yarn'

# Java
cask 'java'
brew 'maven'
brew 'gradle'

# Android
brew 'apktool'
cask 'android-studio'
cask 'android-sdk'
brew 'dex2jar'
cask 'jd-gui'
cask 'intel-haxm'

# Docker
cask 'docker'
cask 'kitematic'